Magma V2.28-3     Wed Jun  5 2024 15:59:53 on euler    [Seed = 1549423915]
Type ? for help.  Type <Ctrl>-D to quit.
> /*
>     Here we verify Lemma 3.3
> */
>
> R<x>:=PolynomialRing(Rationals());
> f := x^6-2*x^5+x^4-2*x^3+6*x^2-4*x+1;
> C:=HyperellipticCurve(f);
>
> for p in [5,17] do
for>    print p , Invariants(ClassGroup(ChangeRing(C, GF(p^2))));
for> end for;
5 [ 19, 19, 0 ]
17 [ 24, 3192, 0 ]
>
> J:=Jacobian(C);
> TorsionSubgroup(J);
Abelian Group isomorphic to Z/19
Defined on 1 generator
Relations:
    19*P[1] = 0
Mapping from: Abelian Group isomorphic to Z/19
Defined on 1 generator
Relations:
    19*P[1] = 0 to JacHyp: J given by a rule [no inverse]
>
> /*
>     Here we verify Lemma 3.5
> */
>
> f := R![1, 2, 5, 10, 10, 4, 1];
> C:=HyperellipticCurve(f);
> J:=Jacobian(C);
>
> for p in PrimesInInterval(5,30) do
for>    print p , Invariants(ClassGroup(ChangeRing(C, GF(p^2))));
for> end for;
5 [ 21, 21, 0 ]
7 [ 3, 651, 0 ]
11 [ 12, 1092, 0 ]
13 [ 3, 21, 399, 0 ]
17 [ 3, 3, 105, 105, 0 ]
19 [ 399, 399, 0 ]
23 [ 3, 91371, 0 ]
29 [ 21, 32781, 0 ]
>
> J:=Jacobian(C);
> TorsionSubgroup(J);
Abelian Group isomorphic to Z/21
Defined on 1 generator
Relations:
    21*P[1] = 0
Mapping from: Abelian Group isomorphic to Z/21
Defined on 1 generator
Relations:
    21*P[1] = 0 to JacHyp: J given by a rule [no inverse]
>

Total time: 20.980 seconds, Total memory usage: 118.91MB
